In [1]:
import pandas as pd 
import numpy as np

In [2]:
rast1=np.random.randint(1,20,(4,3))
rast=np.random.randint(20,40,(4,3))

In [3]:
rast

array([[31, 30, 30],
       [28, 25, 26],
       [32, 20, 39],
       [20, 27, 33]])

In [5]:
#iki diziyi de dataframe'e çevirelim
df1=pd.DataFrame(rast1,columns=["sütun1","sütun2","sütun3"])
df1

   sütun1  sütun2  sütun3
0       3       6       3
1      16      12      11
2       9       8      17
3       6      18      17

In [8]:
df2=pd.DataFrame(rast,columns=["sütun1","sütun2","sütun3"])
df2

   sütun1  sütun2  sütun3
0      31      30      30
1      28      25      26
2      32      20      39
3      20      27      33

In [10]:
#çalışanlar veri seti
emp = pd.DataFrame({
    'Employee ID': [1, 2, 3, 4, 5],
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve'],
    'Department ID': [101, 102,101,103,102],
    'Salary (USD)': [60000, 50000, 70000,48000,52000]
})
emp

   Employee ID     Name  Department ID  Salary (USD)
0            1    Alice            101         60000
1            2      Bob            102         50000
2            3  Charlie            101         70000
3            4    David            103         48000
4            5      Eve            102         52000

In [ ]:
#